// ==========================
// 溫暖備料系統 V1
// data.js
// ==========================



// ==========================
// 酒水
// ==========================


const drinkData = [

"檸檬",
"氣泡水",
"可樂",
"雪碧",
"梅酒",
"清酒",
"威士忌",
"燒酎"

];




// ==========================
// 食材
// ==========================


const foodData = [

"青蔥",
"洋蔥",
"蒜頭",
"小黃瓜",
"雞腿肉",
"雞軟骨",
"玉米筍",
"山藥",
"香菇",
"柴魚片",
"海苔絲",
"白芝麻"

];




// ==========================
// 雜物
// ==========================


const stuffData = [

"換油",
"過碳酸鈉",
"拖把頭",
"衛生紙",
"餐巾紙",
"保鮮膜",
"菜瓜布",
"垃圾袋（大）",
"手套",
"吸油紙",
"罐裝瓦斯",
"酒精（桶）",
"洗碗精（桶）",
"斤袋"

];




// ==========================
// 醬料
// ==========================


const sauceData = [


{

name:"南蠻醬",

materials:[

"洋蔥",
"Q比醬",
"醋",
"糖"

]

},



{

name:"塔塔醬",

materials:[

"美乃滋",
"洋蔥",
"酸黃瓜"

]

},



{

name:"明太子醬",

materials:[

"明太子",
"Q比醬"

]

}


];





// ==========================
// 處理方式
// ==========================


// 食材

const foodActions = [

"採買",
"切片",
"切絲",
"切丁",
"切蔥花",
"切蒜末",
"備用"

];




// 酒水

const drinkActions = [

"採買",
"補貨",
"冰鎮",
"備用"

];




// 雜物

const stuffActions = [

"採買",
"補庫存"

];





// ==========================
// 建立資料
// ==========================


const prepareData = {};



function initData(list,actions){


list.forEach(item=>{


prepareData[item]={


qty:0,

actions:[],

availableActions:actions


};


});


}





initData(
drinkData,
drinkActions
);


initData(
foodData,
foodActions
);


initData(
stuffData,
stuffActions
);
