// ==========================
// 溫暖酒場備料資料庫 V2.0
// ==========================



// 可選處理方式

const actionList = [

"採買",
"確認庫存",
"切片",
"切丁",
"切蔥花",
"切蒜末",
"分切",
"醃製",
"備用"

];





// ==========================
// 酒水資料
// ==========================


const drinkData = [


"甲州威士忌",
"檸檬",
"氣泡水",
"紫蘇梅糖漿",
"葡萄糖漿",
"芭樂糖漿",
"乳酸蜜桃糖漿",
"鮮採番茄汁",
"紅葡萄柚糖漿",
"荔枝糖漿",
"蜂蜜柚子",
"薑汁汽水",
"蘋果醋",
"柳橙糖漿",
"彈珠汽水",
"金萱茶",
"檸檬原汁",
"梅酒",
"清酒",
"燒酎",
"赤梅酒"


];





// ==========================
// 食材資料
// ==========================


const foodData = [


"玉米筍",
"玉米片",
"可樂餅",
"炸牡蠣",
"山藥",
"王將煎餃",
"鹽昆布",
"小黃瓜",
"蒜頭",
"青蔥",
"花生",
"雞軟骨",
"雞腿肉",
"薯條",
"節瓜",
"黑輪",
"水餃",
"炒麵",
"烏龍麵",
"牛肉麵",
"牛肉湯",
"Q比醬",
"明太子",
"柴魚片",
"香菇",
"海苔絲",
"白芝麻",
"白蛋"


];






// ==========================
// 醬料資料
// ==========================


const sauceData = [


{

name:"南蠻醬",

materials:[

"紅蛋",
"七味粉",
"胡椒",
"香菜",
"Q比",
"烹大師",
"洋蔥"

]

},



{

name:"松露醬",

materials:[

"美乃滋",
"醬油",
"洋蔥",
"松露醬"

]

},



{

name:"明太子醬",

materials:[

"明太子",
"Q比醬"

]

},



{

name:"石頭醬",

materials:[

"沙茶",
"花生醬",
"蠔油",
"蒜香粉",
"五香粉",
"蜂蜜"

]

},



{

name:"塔塔醬",

materials:[

"美乃滋",
"洋蔥",
"黃瓜醬",
"檸檬"

]

}


];





// ==========================
// 建立初始資料
// ==========================


const prepareData = {};



function createPrepareData(list){


list.forEach(item=>{


prepareData[item]={

qty:0,

actions:[]

};


});


}



createPrepareData(drinkData);

createPrepareData(foodData);