// ===================================
// 溫暖酒場｜智慧備料系統 V2
// data.js
// ===================================


// ======================
// 酒水備料
// ======================

const drinkData = [

    "甲州威士忌",
    "檸檬",
    "氣泡水",
    "紫蘇梅糖漿",
    "葡萄糖漿",
    "芭樂糖漿",
    "乳酸蜜桃糖漿",
    "芒果糖漿",
    "鮮採番茄汁",
    "紅葡萄柚糖漿",
    "荔枝糖漿",
    "蜂蜜柚子",
    "薑汁汽水",
    "蘋果醋",
    "柳橙糖漿",
    "彈珠汽水",
    "金萱茶",
    "檸檬原汁",
    "梅酒",
    "清酒",
    "燒酎",
    "赤梅酒",
    "金萱酒",
    "烏龍酒"

];




// ======================
// 食材備料
// ======================

const foodData = [

    "玉米筍",
    "玉米片",
    "炸雞粉",
    "可樂餅",
    "炸牡蠣",
    "山藥",
    "王將煎餃",
    "鹽昆布",
    "小黃瓜",
    "小白菜",
    "蒜頭",
    "青蔥",
    "花生",
    "雞軟骨",
    "雞腿肉",
    "薯條",
    "節瓜",
    "黑輪",
    "水餃",
    "炒麵",
    "烏龍麵",
    "牛肉麵",
    "牛肉湯",
    "Q比醬",
    "明太子",
    "柴魚片",
    "香菇",
    "海苔絲",
    "白芝麻",
    "白蛋"

];




// ======================
// 雜物備品
// ======================

const stuffData = [

    "換油",
    "過碳酸鈉",
    "地板清潔劑",
    "拖把頭",
    "衛生紙",
    "餐巾紙",
    "保鮮膜",
    "菜瓜布",
    "抹布",
    "垃圾袋（大）",
    "手套",
    "吸油紙",
    "罐裝瓦斯",
    "酒精（桶）",
    "洗碗精",
    "洗碗精（桶）",
    "斤袋"

];




// ======================
// 醬料製作資料
// ======================

const sauceData = [

    {
        name:"南蠻醬",

        materials:[
            "紅蛋",
            "七味粉",
            "胡椒",
            "香菜",
            "Q比醬",
            "烹大師",
            "洋蔥"
        ]

    },


    {
        name:"松露醬",

        materials:[
            "美乃滋",
            "醬油",
            "洋蔥",
            "松露醬"
        ]

    },


    {
        name:"明太子醬",

        materials:[
            "明太子",
            "Q比醬"
        ]

    },


    {
        name:"石頭醬",

        materials:[
            "沙茶",
            "花生醬",
            "蠔油",
            "蒜香粉",
            "五香粉",
            "蜂蜜"
        ]

    },


    {
        name:"塔塔醬",

        materials:[
            "美乃滋",
            "洋蔥",
            "黃瓜醬",
            "檸檬"
        ]

    }

];




// ======================
// 操作選項
// ======================


// 酒水

const drinkActions = [

    "補貨",
    "製作",
    "備用"

];



// 食材

const foodActions = [

    "採買",
    "前置處理",
    "解凍",
    "製作",
    "備用"

];



// 雜物

const stuffActions = [

    "採買",
    "補庫存"

];



// 醬料材料

const sauceActions = [

    "採買",
    "備用"

];
